{"backend": "tensorflow", "keras_version": "2.2.3", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 1, null, null], "dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_1", "dilation_rate": [1, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "filters": 64, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "padding": "same", "activation": "linear", "bias_constraint": null, "filters": 1, "activity_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"scale": 2.0, "distribution": "normal", "seed": null, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "name": "conv2d_4", "dilation_rate": [1, 1]}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D"}, {"config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["input_1", 0, 0, {}]]], "name": "add_1", "class_name": "Add"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["add_1", 0, 0]]}, "class_name": "Model"}