{"keras_version": "2.2.3", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["add_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 1, null, null]}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "filters": 64, "data_format": "channels_first", "name": "conv2d_1", "padding": "same", "strides": [1, 1]}}, {"name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "filters": 64, "data_format": "channels_first", "name": "conv2d_2", "padding": "same", "strides": [1, 1]}}, {"name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "filters": 64, "data_format": "channels_first", "name": "conv2d_3", "padding": "same", "strides": [1, 1]}}, {"name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "filters": 1, "data_format": "channels_first", "name": "conv2d_4", "padding": "same", "strides": [1, 1]}}, {"name": "add_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}], ["input_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}]}, "backend": "tensorflow"}