{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["conv2d_35", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 512, 512, 1], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_1", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_3", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_4", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_5", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_6", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "activation_6", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_7", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "activation_7", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_8", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "activation_8", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_9", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "activation_9", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_10", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "activation_10", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}}, {"class_name": "Add", "inbound_nodes": [[["activation_10", 0, 0, {}], ["activation_5", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "conv2d_11", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_11", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "activation_11", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_12", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "activation_12", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_13", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "activation_13", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_14", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "activation_14", "config": {"trainable": true, "activation": "relu", "name": "activation_14"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_15", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "activation_15", "config": {"trainable": true, "activation": "relu", "name": "activation_15"}}, {"class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["activation_10", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "conv2d_16", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_16", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "activation_16", "config": {"trainable": true, "activation": "relu", "name": "activation_16"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_17", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "activation_17", "config": {"trainable": true, "activation": "relu", "name": "activation_17"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_18", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "activation_18", "config": {"trainable": true, "activation": "relu", "name": "activation_18"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_19", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "activation_19", "config": {"trainable": true, "activation": "relu", "name": "activation_19"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_20", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "activation_20", "config": {"trainable": true, "activation": "relu", "name": "activation_20"}}, {"class_name": "Add", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_15", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "conv2d_21", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_21", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "activation_21", "config": {"trainable": true, "activation": "relu", "name": "activation_21"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_22", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "activation_22", "config": {"trainable": true, "activation": "relu", "name": "activation_22"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_23", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "activation_23", "config": {"trainable": true, "activation": "relu", "name": "activation_23"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_24", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "activation_24", "config": {"trainable": true, "activation": "relu", "name": "activation_24"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_25", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "activation_25", "config": {"trainable": true, "activation": "relu", "name": "activation_25"}}, {"class_name": "Add", "inbound_nodes": [[["activation_25", 0, 0, {}], ["activation_20", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "conv2d_26", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_26", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "activation_26", "config": {"trainable": true, "activation": "relu", "name": "activation_26"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_27", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_27", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "activation_27", "config": {"trainable": true, "activation": "relu", "name": "activation_27"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv2d_28", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_28", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "activation_28", "config": {"trainable": true, "activation": "relu", "name": "activation_28"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_29", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "activation_29", "config": {"trainable": true, "activation": "relu", "name": "activation_29"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_30", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "activation_30", "config": {"trainable": true, "activation": "relu", "name": "activation_30"}}, {"class_name": "Add", "inbound_nodes": [[["activation_30", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5"}}, {"class_name": "Conv2D", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "conv2d_31", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_31", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "name": "activation_31", "config": {"trainable": true, "activation": "relu", "name": "activation_31"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_31", 0, 0, {}]]], "name": "conv2d_32", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_32", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_32", 0, 0, {}]]], "name": "activation_32", "config": {"trainable": true, "activation": "relu", "name": "activation_32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_32", 0, 0, {}]]], "name": "conv2d_33", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_33", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "name": "activation_33", "config": {"trainable": true, "activation": "relu", "name": "activation_33"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_33", 0, 0, {}]]], "name": "conv2d_34", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_34", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv2d_34", 0, 0, {}]]], "name": "activation_34", "config": {"trainable": true, "activation": "relu", "name": "activation_34"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_34", 0, 0, {}]]], "name": "conv2d_35", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "name": "conv2d_35", "bias_constraint": null, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "use_bias": true, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_regularizer": null}}], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.2.3"}